# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    Makefile                                           :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: akrushin <marvin@42.fr>                    +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2018/02/19 13:53:43 by akrushin          #+#    #+#              #
#    Updated: 2018/02/19 13:53:49 by akrushin         ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

CC		= gcc

NAME	= libft.a

SRC		= includes/*.c

HEADER	= libft.h

OBJ		= *.o *.gch
#OBJ  = $(SRC:.c=.o)

RM		= rm -f

# CFLAGS = -c -Wall -Wextra -Werror
# key >> '-c' - Эта опция означает, что необходима только компиляция.
# Из исходных файлов программы создаются объектные файлы в виде name.o. 
# Компоновка не производится.
CFLAGS	= -c -Wall -Wextra -Werror

all:	$(NAME)

# ar - стандартная утилита Unix, архиватор, не использующий сжатия данных.
# key >> 'r' - Вставляет файлы в архив (с замещением);
# key >> 'c' - Создать архив;
# ------------------------------------------------------------------------------
# Программа 'ranlib' добавит индекс к архиву и получится полноценная статическая 
# библиотека объектных файлов. Так что возьмем за правило тот факт, что утилиту 
# 'ranlib' надо запускать в любом случае, даже если он нее нет никакого эффекта. 
$(NAME):
		$(CC) $(CFLAGS) $(SRC) $(HEADER)
		ar rc $(NAME) $(OBJ) 
		ranlib $(NAME)

clean:
		$(RM) $(OBJ)

fclean: clean
		$(RM) $(NAME)

re:		fclean all

# make будет запускать свой рецепт безоговорочно, независимо от того, 
# существует ли файл с таким именем: цель 'clean' объявляется абстрактной.
.PHONY:	clean fclean re
